{
    "format": "layers-model",
    "generatedBy": "keras v3.3.3",
    "convertedBy": "TensorFlow.js Converter v4.19.0",
    "modelTopology": {
      "keras_version": "3.3.3",
      "backend": "tensorflow",
      "model_config": {
        "class_name": "Sequential",
        "config": {
          "name": "sequential_2",
          "trainable": true,
          "dtype": "float32",
          "layers": [
            {
              "class_name": "InputLayer",
              "config": {
                "batchInputShape": [null, 361],
                "dtype": "float32",
                "sparse": false,
                "name": "dense_6_input"
              }
            },
            {
              "class_name": "Dense",
              "config": {
                "name": "dense_6",
                "trainable": true,
                "dtype": "float32",
                "units": 128,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                  "module": "keras.initializers",
                  "class_name": "GlorotUniform",
                  "config": { "seed": null },
                  "registered_name": null
                },
                "bias_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Zeros",
                  "config": {},
                  "registered_name": null
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              }
            },
            {
              "class_name": "Dropout",
              "config": {
                "name": "dropout_4",
                "trainable": true,
                "dtype": "float32",
                "rate": 0.5,
                "seed": null,
                "noise_shape": null
              }
            },
            {
              "class_name": "Dense",
              "config": {
                "name": "dense_7",
                "trainable": true,
                "dtype": "float32",
                "units": 64,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                  "module": "keras.initializers",
                  "class_name": "GlorotUniform",
                  "config": { "seed": null },
                  "registered_name": null
                },
                "bias_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Zeros",
                  "config": {},
                  "registered_name": null
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              }
            },
            {
              "class_name": "Dropout",
              "config": {
                "name": "dropout_5",
                "trainable": true,
                "dtype": "float32",
                "rate": 0.5,
                "seed": null,
                "noise_shape": null
              }
            },
            {
              "class_name": "Dense",
              "config": {
                "name": "dense_8",
                "trainable": true,
                "dtype": "float32",
                "units": 361,
                "activation": "softmax",
                "use_bias": true,
                "kernel_initializer": {
                  "module": "keras.initializers",
                  "class_name": "GlorotUniform",
                  "config": { "seed": null },
                  "registered_name": null
                },
                "bias_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Zeros",
                  "config": {},
                  "registered_name": null
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              }
            }
          ],
          "build_input_shape": [null, 361]
        }
      },
      "training_config": {
        "loss": "categorical_crossentropy",
        "loss_weights": null,
        "metrics": [
          [
            {
              "class_name": "MeanMetricWrapper",
              "config": {
                "name": "accuracy",
                "dtype": "float32",
                "fn": "categorical_accuracy"
              }
            }
          ]
        ],
        "weighted_metrics": null,
        "run_eagerly": false,
        "steps_per_execution": 1,
        "jit_compile": false,
        "optimizer_config": {
          "class_name": "SGD",
          "config": {
            "name": "SGD",
            "learning_rate": 0.009999999776482582,
            "weight_decay": null,
            "clipnorm": null,
            "global_clipnorm": null,
            "clipvalue": null,
            "use_ema": false,
            "ema_momentum": 0.99,
            "ema_overwrite_frequency": null,
            "loss_scale_factor": null,
            "gradient_accumulation_steps": null,
            "momentum": 0.0,
            "nesterov": false
          }
        }
      }
    },
    "weightsManifest": [
      {
        "paths": [
          "group1-shard1of1.bin"
        ],
        "weights": [
          {
            "name": "sequential_2/dense_6/kernel",
            "shape": [361, 128],
            "dtype": "float32"
          },
          {
            "name": "sequential_2/dense_6/bias",
            "shape": [128],
            "dtype": "float32"
          },
          {
            "name": "sequential_2/dense_7/kernel",
            "shape": [128, 64],
            "dtype": "float32"
          },
          {
            "name": "sequential_2/dense_7/bias",
            "shape": [64],
            "dtype": "float32"
          },
          {
            "name": "sequential_2/dense_8/kernel",
            "shape": [64, 361],
            "dtype": "float32"
          },
          {
            "name": "sequential_2/dense_8/bias",
            "shape": [361],
            "dtype": "float32"
          }
        ]
      }
    ]
  }
  